
# Task_1 (script_3)

# Напишіть скрипт для генерації списку, елементами якого, є всі літери
# латинського алфавіту. Для цього використайте функції chr() і ord(),
# перша приймає ціле число і поверне символ який знаходиться в таблиці
# символів під певним номером, а друга навпаки приймає на вхід рядок і
# поверне номер, під яким знаходиться переданий символ таблиці
# символів
# >>> ord("a")
# 97
# >>>chr(97)
# 'a'

list_1 = []

def alfavit_1():
    for a in range(97, 123):
        list_1.append(chr(a))
    return list_1

print(alfavit_1())
