
# Task_1 (script_1)
# Написати скрипт, який запитує в користувача ім’я, після чого
# користувач вводить ім’я з клавіатури, а скрипт виводить вітальне
# повідомлення. Наприклад “Hello, Misha”

print("Привіт! Давай знайомитися!")
name = str(input("Введіть своє ім'я(ввести потрібно тільки букви) : "))

numbers = set("1234567890")

while set(name) & numbers:
    print("Вводити дозволено лише букви!")
    name = str(input("Введіть своє ім'я(ввести потрібно тільки букви) : "))

print("Вітаємо в нашій системі,",name,"!")

