
# Task_1 (script_3)
# Написати скрипт, який запитує в користувача числа a, b, c і виводить
# повідомлення про мінімальне число. Можна використовувати тільки
# оператори порівняння!

print("\nПривіт! Ця програма допоможе тобі з трьох будь-яких чисел знайти найменше!")

a = int(input("\n\tВведіть своє перше число: "))
b = int(input("\tТепер введіть друге: "))
c = int(input("\tІ нарешті останнє: "))

if a < b and a < c:
    print("Схоже число",a,"найменше")
elif b < a and b < c:
    print("Схоже число",b, "найменше")
elif c < a and c < b:
    print("Схоже число",c, "найменше")
elif a and b < c:
    print("Схоже число", a, "найменше")
elif a and c < b:
    print("Схоже число", a, "найменше")
elif b and c < a:
    print("Схоже число", b, "найменше")
else:
    print("Скоріше за все всі числа рівні одне одному!")

