
# Task_1 (script_4)
# *Написати скрипт, який запитує в користувача ціле число яке є певним
# роком. Програма повинна вивести yes – якщо рік високосний, no якщо
# рік невисокосний. Відповідно до григоріанського календаря, рік є
# високосним, якщо його номер кратний 4, але не кратний 100, а також
# якщо він кратний 400. (використовувати тільки конструкцію if else)

print("\nПрограма яка визначить чи є рік який ви ввели високосним.\n")

while True:
    year = input("Введіть рік, який ви хочете перевірити: ")
    if not year.isnumeric():
        print("Вводити можна тільки цілі числа!")
    else:
        year = int(year)
        break

if year % 4 == 0:
    first = True
    if first == True:
        second = year % 100
        if second != 0:
            print("Число",year,"є високосним!")
        elif second == 0:
            third = year % 400
            if third == 0:
                print("Число",year,"є високосним!")
            else:
                print("Число",year,"не високосне!")
else:
    print("Число",year,"не високосне!")










