
# Task_1 (script_2)

# У файлі file_1.txt знаходиться текст субтитрів взятий з відео на ютубі. Текст
# складається з міток часу і репліки яка була сказана в той момент часу.
# Причому репліка знаходиться в наступному рядку після мітки часу.
# 2. script_2 - отримати файл в якому знаходиться текст з якого видалені всі
# мітки часу. всі субтитри повинні мати вигляд простого тексту. Це означає що
# окрім видалення міток часу, вам потрібно видалити переноси рядків
# Користуйтесь функціями!!! наприклад які функції ви можете написати:
# функція що відкриває файл і повертає вміст файлу, функція що перезаписує в
# файл нові дані, функція що повертає результат завдання 1, функція що
# видаляє з файлу мітки часу і переноси рядків
# Використання функцій є обов’язковою умовою виконання завдання

def script_2(file):
    with open(f"{file}.txt", "r") as file:
        with open("file_2.txt", "w") as file_2:
            str = file.readlines()
            for line in str[1::2]:
                file_2.write(line.rstrip())
                file_2.write(" ")

print(script_2("file_1"))

