
# Task_1 (script_1)

# У файлі file_1.txt знаходиться текст субтитрів взятий з відео на ютубі. Текст
# складається з міток часу і репліки яка була сказана в той момент часу.
# Причому репліка знаходиться в наступному рядку після мітки часу.
# 1. script_1 - отримати словник елементами якого буде пара ключ:значення де
# ключ - мітка часу, значення - репліка в даний момент часу
# Користуйтесь функціями!!! наприклад які функції ви можете написати:
# функція що відкриває файл і повертає вміст файлу, функція що перезаписує в
# файл нові дані, функція що повертає результат завдання 1, функція що
# видаляє з файлу мітки часу і переноси рядків
# Використання функцій є обов’язковою умовою виконання завдання




def script_1(file):
    with open(f"{file}.txt", "r") as file:
        key = []
        values = []
        str = file.readlines()
        for line in str[0::2]:
            key.append(line.rstrip())
        for line in str[1::2]:
            values.append(line.rstrip())
        result = dict(zip(key, values))
    return result

print(script_1("file_1"))


