
# Task_3 (script_1)

# Написати функцію яка рахує гіпотензузу і декоратор на функцію, який
# виводить на екран текст з довжиною катетів і гіпотенузи. Важливо! Функція
# повинно повернути саме значення гіпотенузи як число, а декоратор повинен
# зробити вивід на екран наприклад такого тексту “При катетах 3, 4 –
# гіпотенуза дорівнює 5”.
# Для обчислення гіпотенузи можете скористатись бібліотекою math. На
# бонусний бал можете реалізувати алгоритм обчислення гіпотенузи самі!

def result_hypotenuse(func):

    def wrapper(*args, **kwargs):

        result = func(*args, **kwargs)
        print(f"При катетах {args} – гіпотенуза дорівнює: {result}")

        return result

    return wrapper



@result_hypotenuse
def hypotenuse(x, y):
    c = x**2 + y**2
    sqrt = c ** (0.5)
    return sqrt


hypotenuse(5, 6)
hypotenuse(20, 56)

