
# Task_4 (script_2)

# Користувач вводить два рядки з клавіатури. Якщо довжина першого
# більша, вивести на екран що рядок з таким значенням найдовший,
# якщо довжина другого більша, аналогічно. Якщо довжини рядків
# однакові, вивести повідомлення що рядки рівні

line_1 = input("Введіть перший рядок: ")
line_2 = input("Введіть другий: ")

if len(line_1) > len(line_2):
    print("Перший рядок довше.")
elif len(line_1) < len(line_2):
    print("Другий рядок довше.")
else:
    print("Схоже два рядки однакові за довжиною.")
